
formNameXBRL = '0420502 Справка о стоимости чистых активов, в том числе стоимости активов (имущества), \
акционерного инвестиционного фонда (паевого инвестиционного фонда) \
Раздел 1. Реквизиты акционерного инвестиционного фонда (паевого инвестиционного фонда)'

urlStart = "http://www.cbr.ru/xbrl/nso/uk/"
urlAdd = "/tab/"
tax = '2019-05-01'
urlName = "SR_0420502_R1"
url = urlStart + tax + urlAdd + urlName
# url = "http://www.cbr.ru/xbrl/nso/uk/2019-05-01/tab/SR_0420502_R1"


formNameAvancore = "Раздел I. Реквизиты акционерного инвестиционного фонда (паевого инвестиционного фонда)"
