""" Формирование форм СЧА - расшифровки разделов"""

# from module.functions import listSheetsName
import module.functions as fun
from module.data_load import load_pif_info
import module.dataCopy as dcop
import module.adjustments as adj
from module.dataCheck import id_errors
from openpyxl.utils import column_index_from_string  # 'B' -> 2
from openpyxl.utils.cell import get_column_letter  # 3 -> 'C'
from module.globals import *
from module.dataCheck import empty_cell


# Выбираем формы: расшифровки разделов
# 0420502 Справка о стоимости _14	SR_0420502_Rasshifr_Akt_P1_P1
# 0420502 Справка о стоимости _15	SR_0420502_Rasshifr_Akt_P1_P2
# 0420502 Справка о стоимости _16	SR_0420502_Rasshifr_Akt_P2_1
# 0420502 Справка о стоимости _17	SR_0420502_Rasshifr_Akt_P2_10
# 0420502 Справка о стоимости _18	SR_0420502_Rasshifr_Akt_P2_11
# 0420502 Справка о стоимости _19	SR_0420502_Rasshifr_Akt_P2_2
# 0420502 Справка о стоимости _20	SR_0420502_Rasshifr_Akt_P2_3
# 0420502 Справка о стоимости _21	SR_0420502_Rasshifr_Akt_P2_4
# 0420502 Справка о стоимости _22	SR_0420502_Rasshifr_Akt_P2_5
# 0420502 Справка о стоимости _23	SR_0420502_Rasshifr_Akt_P2_6
# 0420502 Справка о стоимости _24	SR_0420502_Rasshifr_Akt_P2_7
# 0420502 Справка о стоимости _25	SR_0420502_Rasshifr_Akt_P2_8
# 0420502 Справка о стоимости _26	SR_0420502_Rasshifr_Akt_P2_9
# 0420502 Справка о стоимости _27	SR_0420502_Rasshifr_Akt_P3_1
# 0420502 Справка о стоимости _28	SR_0420502_Rasshifr_Akt_P3_3
# 0420502 Справка о стоимости _29	SR_0420502_Rasshifr_Akt_P3_4
# 0420502 Справка о стоимости _30	SR_0420502_Rasshifr_Akt_P3_5
# 0420502 Справка о стоимости _31	SR_0420502_Rasshifr_Akt_P3_6
# 0420502 Справка о стоимости _32	SR_0420502_Rasshifr_Akt_P3_7
# 0420502 Справка о стоимости _33	SR_0420502_Rasshifr_Akt_P4_1
# 0420502 Справка о стоимости _34	SR_0420502_Rasshifr_Akt_P4_2_1
# 0420502 Справка о стоимости _35	SR_0420502_Rasshifr_Akt_P4_2_2
# 0420502 Справка о стоимости _36	SR_0420502_Rasshifr_Akt_P5_1
# 0420502 Справка о стоимости _37	SR_0420502_Rasshifr_Akt_P5_2
# 0420502 Справка о стоимости _38	SR_0420502_Rasshifr_Akt_P5_3
# 0420502 Справка о стоимости _39	SR_0420502_Rasshifr_Akt_P5_4
# 0420502 Справка о стоимости _40	SR_0420502_Rasshifr_Akt_P5_5
# 0420502 Справка о стоимости _41	SR_0420502_Rasshifr_Akt_P6_1_1
# 0420502 Справка о стоимости _42	SR_0420502_Rasshifr_Akt_P6_1_2
# 0420502 Справка о стоимости _43	SR_0420502_Rasshifr_Akt_P6_2_1
# 0420502 Справка о стоимости _44	SR_0420502_Rasshifr_Akt_P6_2_2
# 0420502 Справка о стоимости _45	SR_0420502_Rasshifr_Akt_P7_1
# 0420502 Справка о стоимости _46	SR_0420502_Rasshifr_Akt_P7_2
# 0420502 Справка о стоимости _47	SR_0420502_Rasshifr_Akt_P7_3
# 0420502 Справка о стоимости _48	SR_0420502_Rasshifr_Akt_P7_4
# 0420502 Справка о стоимости _49	SR_0420502_Rasshifr_Akt_P7_5
# 0420502 Справка о стоимости _50	SR_0420502_Rasshifr_Akt_P7_6
# 0420502 Справка о стоимости _51	SR_0420502_Rasshifr_Akt_P7_7
# 0420502 Справка о стоимости _52	SR_0420502_Rasshifr_Akt_P8_1
# 0420502 Справка о стоимости _53	SR_0420502_Rasshifr_Akt_P8_2
# 0420502 Справка о стоимости _54	SR_0420502_Rasshifr_Ob_P1
# 0420502 Справка о стоимости _55	SR_0420502_Rasshifr_Ob_P2
# 0420502 Справка о стоимости _58	SR_0420502_Rasshifr_Akt_P3_2

def correct_RegNumberKO(ws, rowBegin, col):
    """Корректируем номер кредитной организации"""
    # (поле:"Регистрационный номер кредитной организации")
    # начиная со строки 'rowBegin', колонка 'col'
    for row in range(rowBegin, ws.max_row):
        ws.cell(row, col).value = str(ws.cell(row, col).value).split('.')[0]


def rashifr(wb, df_avancor, id_fond):
    def copy_rashifr(ws, AvancoreTitle):
        """ Копируем данные форм-расшифровок"""

        # номер первой и последней строки с данными в таблице Аванкор
        data_row, row_end = adj.data_search(df_avancor, AvancoreTitle)

        if data_row != row_end:
            # Если номера первой и последней строки НЕ совпадают, то Раздел содержит данные
            # список всех номеров строк в таблице Аванкор
            rows_numbers = [x for x in range(data_row, row_end + 1)]

            # цифра в последней колонке и номер строки с идектификаторами в таблице XBRL
            # (количество колонок для копирования)
            max_number, id_row = fun.end_col_number(ws)

            # Вставить нужное кол-во строк перед строкой "Итого"
            ws.insert_rows(ws.max_row, amount=(len(rows_numbers) - 1))

            # координаты первой ячейки в таблице XBRL
            col_begin, row_begin = fun.begin_cell(ws, max_number)

            # номера колонок с иденитификаторами в таблице XBRL
            id_cols = fun.id_nombers(col_begin)

            # Номера колонок в таблице Аванкор, за исключением пустых"""
            columns_numbers = fun.find_columns_numbers(df_avancor, collumn_max, max_number, data_row)

            # Копирование данных из таблицы Аванков в таблицу XBRL
            dcop.copy_data(ws, df_avancor, rows_numbers, columns_numbers, row_begin, col_begin)

            return True

        else:
            # Если номера первой и последней строки совпадают, то Раздел пуст.
            # Удаляем вкладку
            # wb.remove(ws)
            return False

    # **********************************************************************************
    def rashifr_14_v2():
        """0420502 Справка о стоимости _14	SR_0420502_Rasshifr_Akt_P1_P1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P1_P1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'J11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '1.1. Денежные средства на счетах в кредитных организациях'

        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Корректируем номер кредитной организации
            # (поле:"Регистрационный номер кредитной организации")
            # начиная с 11 строки
            # for row in range(11, ws.max_row):
            #     ws.cell(row, 6).value = str(ws.cell(row, 6).value).split('.')[0]
            correct_RegNumberKO(ws, 11, 6)
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # копируем Банковский счет из столбца "Примечание"
            col_from = 'L'
            # col_name = ws.max_column
            # adj.copy_cells_one2one(ws, row_begin, col_id, col_from, del_old_sell=True)
            adj.copy_bank_account(id_fond, wb_pif_info, ws,
                                  row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем идентификатор кредитной организации
            col_from = 'D'
            adj.copy_cells_one2one(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования ОГРН, ИНН
            adj.corrector_00(ws, 'E')


        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_15_v2():
        """0420502 Справка о стоимости _15	SR_0420502_Rasshifr_Akt_P1_P2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P1_P2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '1.2. Денежные средства на счетах по депозиту в кредитных организациях'

        # При наличии депозитов в файле-Аванкор нужно указывать номер счета депозита
        adj.depozitID(df_avancor, AvancoreTitle)

        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Корректируем номер кредитной организации
            # (поле:"Регистрационный номер кредитной организации")
            # начиная с 11 строки, колонка 6
            # for row in range(11, ws.max_row):
            #     ws.cell(row, 6).value = str(ws.cell(row, 6).value).split('.')[0]
            correct_RegNumberKO(ws, 11, 6)
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # копируем Банковский счет из столбца "Примечание"
            col_from = 'M'
            # col_name = ws.max_column
            # adj.copy_cells_one2one(ws, row_begin, col_id, col_from, del_old_sell=True)
            adj.copy_bank_account(id_fond, wb_pif_info, ws,
                                  row_begin, col_id[0], col_from)

            # ---------------------------------------------------------
            # Вставляем идентификатор кредитной организации
            col_from = 'D'
            adj.copy_cells_one2one(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования ОГРН, Рег.номер
            adj.corrector_00(ws, 'E', 'F')
            # ---------------------------------------------------------
            # Добавляем пробел в конце строки
            adj.corrector_depozit_type(ws, col='I')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_16_v2():
        """0420502 Справка о стоимости _16	SR_0420502_Rasshifr_Akt_P2_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'M11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.1. Облигации российских хозяйственных обществ'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор выпуска ценной бумаги"
            col_from = 'O'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'I'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования ОГРН, Рег.номер
            adj.corrector_00(ws, 'E', 'F')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_17_v2():
        """0420502 Справка о стоимости _17	SR_0420502_Rasshifr_Akt_P2_10"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_10'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.10. Ипотечные сертификаты участия'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11

            # ---------------------------------------------------------
            # Вставляем "Идентификатор ипотечного сертификата участия"
            col_from = 'D'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'M'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'E', 'G', 'H')


        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_18_v2():
        """0420502 Справка о стоимости _18	SR_0420502_Rasshifr_Akt_P2_11"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_11'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'H11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.11. Иные ценные бумаги российских эмитентов (за исключением закладных)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор ценной бумаги"
            col_from = 'C'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'E', 'F')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_19_v2():
        """0420502 Справка о стоимости _19	SR_0420502_Rasshifr_Akt_P2_2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.2. Государственные ценные бумаги Российской Федерации'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор выпуска ценной бумаги"
            col_from = 'G'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'M'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'E', 'F')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_20_v2():
        """0420502 Справка о стоимости _20	SR_0420502_Rasshifr_Akt_P2_3"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_3'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.3. Государственные ценные бумаги субъектов Российской Федерации'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор выпуска ценной бумаги"
            col_from = 'H'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'N'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'F', 'G')


        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_21_v2():
        """0420502 Справка о стоимости _21	SR_0420502_Rasshifr_Akt_P2_4"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_4'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'L11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.4. Муниципальные ценные бумаги'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор выпуска ценной бумаги"
            col_from = 'H'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'N'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'F', 'G')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_22_v2():
        """0420502 Справка о стоимости _22	SR_0420502_Rasshifr_Akt_P2_5"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_5'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'S11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.5. Российские депозитарные расписки'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C', 'D']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор выпуска ценной бумаги"
            col_from = 'I'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'U'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор российской депозитарной расписки"
            col_from = 'M'  # 'TIN'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'F', 'G')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_23_v2():
        """0420502 Справка о стоимости _23	SR_0420502_Rasshifr_Akt_P2_6"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_6'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'L11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.6. Инвестиционные паи паевых инвестиционных фондов'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C', 'D']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор выпуска ценной бумаги"
            # (совпадает с "Идентификатор паевого инвестиционного фонда" - возможны ошибки)
            col_from = 'F'  # '...номер ПДУ'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'N'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор паевого инвестиционного фонда"
            # (совпадает с "Идентификатор выпуска ценной бумаги" - возможны ошибки)
            col_from = 'F'  # '...номер ПДУ'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'H', 'I')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_24_v2():
        """0420502 Справка о стоимости _24	SR_0420502_Rasshifr_Akt_P2_7"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_7'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 3

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.7. Акции российских акционерных обществ'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем 'Идентификатор выпуска ценной бумаги'
            col_from = 'H'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем 'Bдентификатор биржи'
            col_from = 'N'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования ОГРН, ИНН
            adj.corrector_00(ws, 'E', 'F')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_25_v2():
        """0420502 Справка о стоимости _25	SR_0420502_Rasshifr_Akt_P2_8"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_8'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'H11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.8. Векселя российских хозяйственных обществ'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем 'Идентификатор векселя'
            # ('Идентификатор векселя' необходимо указать в колонке-"Примечание")
            # (копируется из колонки-"Примечание")
            col_from = 'J'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'D', 'E')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_26_v2():
        """0420502 Справка о стоимости _26	SR_0420502_Rasshifr_Akt_P2_9"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P2_9'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'L11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '2.9. Облигации с ипотечным покрытием'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем 'Идентификатор выпуска ценной бумаги'
            col_from = 'H'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем 'Bдентификатор биржи'
            col_from = 'N'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'E', 'F')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_27_v2():
        """0420502 Справка о стоимости _27	SR_0420502_Rasshifr_Akt_P3_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P3_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'M11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '3.1. Облигации иностранных коммерческих организаций'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем 'Идентификатор выпуска ценной бумаги'
            col_from = 'H'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем 'Bдентификатор биржи'
            col_from = 'O'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_28_v2():
        """0420502 Справка о стоимости _28	SR_0420502_Rasshifr_Akt_P3_3"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P3_3'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '3.3. Облигации международных финансовых организаций'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем 'Идентификатор выпуска ценной бумаги'
            col_from = 'F'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем 'Bдентификатор биржи'
            col_from = 'M'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_29_v2():
        """0420502 Справка о стоимости _29	SR_0420502_Rasshifr_Akt_P3_4"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P3_4'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'S11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '3.4. Иностранные депозитарные расписки'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C', 'D']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор выпуска ценной бумаги"
            col_from = 'I'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'V'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор иностранной депозитарной расписки"
            col_from = 'G'  # колонка - 'TIN'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_30_v2():
        """0420502 Справка о стоимости _30	SR_0420502_Rasshifr_Akt_P3_5"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P3_5'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'L11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '3.5. Паи (акции) иностранных инвестиционных фондов'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем 'Идентификатор выпуска ценной бумаги'
            col_from = 'F'  # колонка - "TIN"
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем 'Bдентификатор биржи'
            col_from = 'O'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_31_v2():
        """0420502 Справка о стоимости _31	SR_0420502_Rasshifr_Akt_P3_6"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P3_6'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '3.6. Акции иностранных акционерных обществ'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем 'Идентификатор выпуска ценной бумаги'
            col_from = 'G'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем 'Bдентификатор биржи'
            col_from = 'N'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_32_v2():
        """0420502 Справка о стоимости _32	SR_0420502_Rasshifr_Akt_P3_7"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P3_7'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'I11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '3.7. Иные ценные бумаги иностранных эмитентов'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем 'Идентификатор ценной бумаги'
            col_from = 'C'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)


        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    # def rashifr_33():
    #     """0420502 Справка о стоимости _33	SR_0420502_Rasshifr_Akt_P4_1"""
    #
    #     shortURL = 'SR_0420502_Rasshifr_Akt_P4_1'  # код вкладки
    #     sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
    #     ws = wb[sheetName]
    #     # ячейки для форматирования
    #     cellFormat = 'H11'
    #     cellFormatN = 2
    #
    #     print(f'{sheetName} - {shortURL}')
    #     # ---------------------------------------------------------
    #     # Переносим данные в форму:
    #     # Заголовки формы в файле-Аванкор
    #     AvancoreTitle = '4.1. Недвижимое имущество'
    #     if copy_rashifr(ws, AvancoreTitle):
    #         # ---------------------------------------------------------
    #         # Записываем в форму идентификатор фонда
    #         dcop.copy_id_fond_to_tbl(ws, id_fond)
    #         # ---------------------------------------------------------
    #         # Форматируем ячейки
    #         fun.cellFormat(ws, cellFormat, cols=cellFormatN)
    #     else:
    #         # Если ничего скопировано не было, то Раздел пуст.
    #         # Удаляем вкладку
    #         wb.remove(ws)

    # **********************************************************************************
    def rashifr_33_v2():
        """0420502 Справка о стоимости _33	SR_0420502_Rasshifr_Akt_P4_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P4_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'H11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '4.1. Недвижимое имущество'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем Идентификатор объекта недвижимости
            col_from = 'C'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

            # ---------------------------------------------------------
            # проверяем все ли ячейки заполнены
            cellBegin = col_id[0] + str(row_begin)
            row_end = ws.max_row - 1
            col_end = get_column_letter(ws.max_column - 1)
            cellEnd = col_end + str(row_end)
            empty_cell(ws, cellBegin, cellEnd)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_34_v2():
        """0420502 Справка о стоимости _34	SR_0420502_Rasshifr_Akt_P4_2_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P4_2_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '4.2.1. Право аренды недвижимого имущества (арендодатель – физическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем идентификатор Объекта недвижимости
            col_from = 'E'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_35_v2():
        """0420502 Справка о стоимости _35	SR_0420502_Rasshifr_Akt_P4_2_2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P4_2_2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'L11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '4.2.2. Право аренды недвижимого имущества (арендодатель – юридическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем идентификатор Объекта недвижимости
            col_from = 'F'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'D')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_36_v2():
        """0420502 Справка о стоимости _36	SR_0420502_Rasshifr_Akt_P5_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P5_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '5.1. Имущественные права из договоров участия в долевом строительстве объектов недвижимого имущества'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем Идентификатор договора
            col_from = 'C'
            adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[0], col_from,
                                   delta=False, dogovor_n=True, fond_name=True)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'G')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_37_v2():
        """0420502 Справка о стоимости _37	SR_0420502_Rasshifr_Akt_P5_2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P5_2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '5.2. Имущественные права, связанные с возникновением права собственности ' \
                        'на объект недвижимости (его часть) после завершения его строительства (создание) ' \
                        'и возникающие из договора, стороной по которому является юридическое лицо, ' \
                        'которому принадлежит право собственности или иное вещное право, ' \
                        'включая право аренды, на земельный участок, выделенный в установленном порядке ' \
                        'для целей строительства объекта недвижимости, и (или) имеющее разрешение ' \
                        'на строительство объекта недвижимости на указанном земельном участке, ' \
                        'либо юридическое лицо, инвестирующее денежные средства ' \
                        'или иное имущество в строительство объекта недвижимости'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем Идентификатор договора
            col_from = 'C'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[0], col_from,
            #                        delta=False, dogovor_n=True, fond_name=True)
            adj.id_dogovor(id_fond, ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'G')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_38_v2():
        """0420502 Справка о стоимости _38	SR_0420502_Rasshifr_Akt_P5_3"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P5_3'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '5.3. Имущественные права из договоров, на основании ' \
                        'которых осуществляется строительство (создание) объектов ' \
                        'недвижимого имущества (в том числе на месте объектов ' \
                        'недвижимости) на выделенном в установленном порядке ' \
                        'для целей строительства (создания) указанного объекта ' \
                        'недвижимости земельном участке, который (право аренды которого) ' \
                        'составляет активы акционерного инвестиционного фонда ' \
                        '(паевого инвестиционного фонда)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем Идентификатор договора
            col_from = 'C'
            adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[0], col_from,
                                   delta=False, dogovor_n=True, fond_name=True)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'G')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_39_v2():
        """0420502 Справка о стоимости _39	SR_0420502_Rasshifr_Akt_P5_4"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P5_4'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '5.4. Имущественные права из договоров, на основании ' \
                        'которых осуществляется реконструкция объектов недвижимости, ' \
                        'составляющих активы акционерного инвестиционного фонда ' \
                        '(паевого инвестиционного фонда)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем Идентификатор договора
            col_from = 'C'
            adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[0], col_from,
                                   delta=False, dogovor_n=True, fond_name=True)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'G')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_40_v2():
        """0420502 Справка о стоимости _40	SR_0420502_Rasshifr_Akt_P5_5"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P5_5'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'D11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '5.5. Иные имущественные права'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # формируем "Идентификатор договора" из столбца "Примечание"
            col_from = 'F'
            # col_name = ws.max_column
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from,
                                   del_old_sell=True, id_fond=id_fond)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_41_v2():
        """0420502 Справка о стоимости _41	SR_0420502_Rasshifr_Akt_P6_1_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P6_1_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'L11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '6.1.1. Денежные требования по кредитным договорам и договорам займа (должник – физическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор физического лица"
            col_pas = 'J'
            col_fio = 'I'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[0], col_from,
            #                        word_start=3, word_end=5, fio=col_fio)
            adj.id_fiz_face(ws, row_begin, col_fio, col_pas, col_id[0])
            # ---------------------------------------------------------
            # Вставляем Идентификатор денежного требования
            col_from = 'D'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[1], col_from,
            #                        delta=True, dogovor_n=True, fond_name=True)

            adj.id_den_treb(id_fond, ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_42_v2():
        """0420502 Справка о стоимости _42	SR_0420502_Rasshifr_Akt_P6_1_2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P6_1_2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'N11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '6.1.2. Денежные требования по кредитным договорам и договорам займа (должник – юридическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем Идентификатор юридического лица
            col_from = 'L'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем Идентификатор денежного требования
            col_from = 'D'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[1], col_from,
            #                        word_end=1,
            #                        delta=True, dogovor_n=True, fond_name=True)
            adj.id_den_treb(id_fond, ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования ОГРН, ИНН
            adj.corrector_00(ws, 'K', 'L')
            # ---------------------------------------------------------
            # Добавляем в колонку "Наименование должника" текст из
            # колонки "Примечание".
            # (необходимо при указании "ИП" для физ.лица)
            adj.add_IP(ws, 'P', 'I')
            # ---------------------------------------------------------

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_43_v2():
        """0420502 Справка о стоимости _43	SR_0420502_Rasshifr_Akt_P6_2_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P6_2_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'L11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '6.2.1. Закладные (должник – физическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Иидентификатор физического лица"
            col_pas = 'J'
            col_fio = 'I'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[0], col_from,
            #                        word_start=3, word_end=5, fio=col_fio)
            adj.id_fiz_face(ws, row_begin, col_fio, col_pas, col_id[0])
            # ---------------------------------------------------------
            # Вставляем Идентификатор денежного требования
            col_from = 'D'
            adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[1], col_from,
                                   delta=True, dogovor_n=True, fond_name=True)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_44_v2():
        """0420502 Справка о стоимости _44	SR_0420502_Rasshifr_Akt_P6_2_2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P6_2_2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'N11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '6.2.2. Закладные (должник – юридическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор юридического лица"
            col_from = 'L'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор денежного требования"
            col_from = 'D'
            adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[1], col_from,
                                   word_end=1,
                                   delta=True, dogovor_n=True, fond_name=True)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'K', 'L')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_45_v2():
        """0420502 Справка о стоимости _45	SR_0420502_Rasshifr_Akt_P7_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P7_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'H11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '7.1. Доли в уставных капиталах российских обществ с ограниченной ответственностью'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем Идентификатор юридического лица (ОГРН)
            col_from = 'D'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'D', 'E')

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_46_v2():
        """0420502 Справка о стоимости _46	SR_0420502_Rasshifr_Akt_P7_2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P7_2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'H11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '7.2. Права участия в уставных капиталах иностранных коммерческих организаций'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем Идентификатор юридического лица (TIN)
            col_from = 'D'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_47_v2():
        """0420502 Справка о стоимости _47	SR_0420502_Rasshifr_Akt_P7_3"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P7_3'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'H11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '7.3. Проектная документация для строительства или реконструкции объекта недвижимости'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # формируем "Идентификатор документа" из столбца "Примечание"
            col_from = 'J'
            # col_name = ws.max_column
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from,
                                   del_old_sell=True, id_fond=id_fond)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_48_v2():
        """0420502 Справка о стоимости _48	SR_0420502_Rasshifr_Akt_P7_4"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P7_4'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'F11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = 'Подраздел 7.4. Драгоценные металлы'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # формируем "Идентификатор драгоценного металла" из столбца "Примечание"
            col_from = 'H'
            # col_name = ws.max_column
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from,
                                   del_old_sell=True, id_fond=id_fond)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_49_v2():
        """0420502 Справка о стоимости _49	SR_0420502_Rasshifr_Akt_P7_5"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P7_5'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'G11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '7.5. Требования к кредитной организации выплатить денежный эквивалент драгоценных металлов по текущему курсу'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # формируем "Идентификатор требования..." из столбца "Примечание"
            col_from = 'I'
            # col_name = ws.max_column
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from,
                                   del_old_sell=True, id_fond=id_fond)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'F')


        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_50_v2():
        """0420502 Справка о стоимости _50	SR_0420502_Rasshifr_Akt_P7_6"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P7_6'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'E11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '7.6. Художественные ценности'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # формируем "Идентификатор художественной ценности" из столбца "Примечание"
            col_from = 'G'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from,
                                   del_old_sell=True, id_fond=id_fond)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_51_v2():
        """0420502 Справка о стоимости _51	SR_0420502_Rasshifr_Akt_P7_7"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P7_7'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'E11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '7.7. Иное имущество, не указанное в таблицах пунктов 7.1 - 7.6'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Добавляем подробное описание имущества
            # adj.corrector_scha_51_(ws, df_identifier)
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # формируем "Вид иного имущества" из столбца "Примечание"
            col_from = 'G'
            # col_name = ws.max_column
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from,
                                   del_old_sell=True, id_fond=id_fond)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Удаляем лишние данные из последней строки в столбце "D"
            ws.cell( ws.max_row, column_index_from_string("D")).value = None

            # ---------------------------------------------------------
            # Проставляем нули в первой и последних строках таблицы
            # 0420502 Справка о стоимости ч_9	SR_0420502_R3_P7
            shortURL = 'SR_0420502_R3_P7'  # код вкладки
            sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
            ws = wb[sheetName]
            cellBegin = 'C10'
            fun.cell_00(ws, cellBegin)


        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_52_v2():
        """0420502 Справка о стоимости _52	SR_0420502_Rasshifr_Akt_P8_1"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P8_1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'K11'
        cellFormatN = 3

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '8.1. Дебиторская задолженность (должник – физическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор физического лица"
            col_id_ = col_id[0]
            col_pas = 'J'
            col_fio = 'H'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[0], col_pas,
            #                        word_start=3, word_end=7,
            #                        fio=col_fio, fond_name=False)
            adj.id_fiz_face(ws, row_begin, col_fio, col_pas, col_id_)

            # ---------------------------------------------------------
            # Вставляем идентификатор основания дебиторской задолженности
            col_id_ = col_id[1]
            col_from = 'F'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[1], col_from,
            #                        delta=True, dogovor_n=True, fond_name=True)
            adj.id_osnovaniya_zadilzhennosti(id_fond, ws, row_begin, col_id_, col_from)

            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_53_v2():
        """0420502 Справка о стоимости _53	SR_0420502_Rasshifr_Akt_P8_2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P8_2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'M11'
        cellFormatN = 3

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '8.2. Дебиторская задолженность (должник – юридическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Корректируем ИНН
            # начиная с 11 строки, колонка 9 (I=9)
            for row in range(11, ws.max_row):
                ws.cell(row, 9).value = str(ws.cell(row, 9).value).split('.')[0]
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования ИНН
            # adj.corrector_00(ws, row=11, col='I')
            # adj.corrector_00(ws, row=11, col='J')
            adj.corrector_00(ws, 'I', 'J')
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Вставляем идентификатор дебитора
            row_begin = 11
            col_id = 'B'
            col_from = 'J'
            adj.copy_cells_one2one(ws, row_begin, col_id, col_from)
            # ---------------------------------------------------------
            # Вставляем идентификатор основания задолженности
            row_begin = 11
            col_id = 'C'
            col_from = 'F'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id, col_from,
            #                        delta=True, dogovor_n=True, fond_name=True)
            adj.id_osnovaniya_zadilzhennosti(id_fond, ws, row_begin, col_id, col_from)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования...
            adj.corrector_00(ws, 'I', 'J')
            # ---------------------------------------------------------
            # Добавляем в колонку "Наименование должника" текст из
            # колонки "Примечание".
            # (необходимо при указании "ИП" для физ.лица)
            # adj.add_IP(ws, 'P', 'H')
            # ---------------------------------------------------------
            # проверяем все ли ячейки заполнены
            cellBegin = 'B11'
            row_end = ws.max_row - 1
            col_end = get_column_letter(ws.max_column - 1)
            cellEnd = col_end + str(row_end)
            empty_cell(ws, cellBegin, cellEnd)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_54_v2():
        """0420502 Справка о стоимости _54	SR_0420502_Rasshifr_Ob_P1"""

        shortURL = 'SR_0420502_Rasshifr_Ob_P1'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'J11'
        cellFormatN = 3

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = 'Подраздел 1. Кредиторская задолженность (кредитор – физическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор физического лица"
            col_pas = 'I'
            col_fio = 'H'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[0], col_from,
            #                        word_start=3, word_end=5, fio=col_fio)
            adj.id_fiz_face(ws, row_begin, col_fio, col_pas, col_id[0])
            # ---------------------------------------------------------
            # Вставляем идентификатор основания задолженности
            col_id_ = col_id[1]
            col_from = 'F'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[1], col_from,
            #                        delta=True, dogovor_n=True, fond_name=True)
            adj.id_osnovaniya_zadilzhennosti(id_fond, ws, row_begin, col_id_, col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_55_v2():
        """0420502 Справка о стоимости _55	SR_0420502_Rasshifr_Ob_P2"""

        shortURL = 'SR_0420502_Rasshifr_Ob_P2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'M11'
        cellFormatN = 3

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = 'Подраздел 2. Кредиторская задолженность (кредитор – юридическое лицо)'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)
            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем идентификатор кредитора
            col_from = 'I'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем идентификатор основания задолженности
            col_id_ = col_id[1]
            col_from = 'F'
            # adj.copy_hash_of_cells(id_fond, ws, row_begin, col_id[1], col_from,
            #                        word_end=1,
            #                        delta=True, dogovor_n=True, fond_name=True)
            adj.id_osnovaniya_zadilzhennosti(id_fond, ws, row_begin, col_id_, col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентификаторы
            id_errors(ws, col_id, row_begin=row_begin)
            # ---------------------------------------------------------
            # Убираем лишние '.00' в конце строки,
            # которые могут появиться после копирования ОГРН, ИНН
            adj.corrector_00(ws, 'I', 'J')
            # adj.corrector_00(ws, row=11, col='I')
            # adj.corrector_00(ws, row=11, col='J')

            # ---------------------------------------------------------
            # проверяем все ли ячейки заполнены
            cellBegin = col_id[0] + str(row_begin)
            row_end = ws.max_row - 1
            col_end = get_column_letter(ws.max_column - 1)
            cellEnd = col_end + str(row_end)
            empty_cell(ws, cellBegin, cellEnd)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    def rashifr_58_v2():
        """0420502 Справка о стоимости _58	SR_0420502_Rasshifr_Akt_P3_2"""

        shortURL = 'SR_0420502_Rasshifr_Akt_P3_2'  # код вкладки
        sheetName = fun.sheetNameFromUrl(urlSheets, shortURL)  # имя вкладки
        ws = wb[sheetName]
        # ячейки для форматирования
        cellFormat = 'L11'
        cellFormatN = 2

        print(f'{sheetName} - {shortURL}')
        # ---------------------------------------------------------
        # Переносим данные в форму:
        # Заголовки формы в файле-Аванкор
        AvancoreTitle = '3.2. Облигации иностранных государств'
        if copy_rashifr(ws, AvancoreTitle):
            # ---------------------------------------------------------
            # Записываем в форму идентификатор фонда
            dcop.copy_id_fond_to_tbl(ws, id_fond)
            # ---------------------------------------------------------
            # Форматируем ячейки
            fun.cellFormat(ws, cellFormat, cols=cellFormatN)

            # ---------------------------------------------------------
            # Столбцы с Идентификаторами
            col_id = ['B', 'C']
            # Номер первой строки с данными
            row_begin = 11
            # ---------------------------------------------------------
            # Вставляем "Идентификатор выпуска ценной бумаги"
            col_from = 'G'
            adj.copy_cells_one2one(ws, row_begin, col_id[0], col_from)
            # ---------------------------------------------------------
            # Вставляем "Идентификатор Биржи"
            col_from = 'N'
            adj.copy_birzha_id(ws, row_begin, col_id[1], col_from)
            # ---------------------------------------------------------
            # Проверяем заполнены ли все идентивикаторы
            id_errors(ws, col_id, row_begin=row_begin)

        else:
            # Если ничего скопировано не было, то Раздел пуст.
            # Удаляем вкладку
            wb.remove(ws)

    # **********************************************************************************
    wb_pif_info = load_pif_info(file_name=pif_info,
                                path_2file=dir_shablon)

    urlSheets = fun.codesSheets(wb)  # словарь - "код вкладки":"имя вкладки"
    # Кол-во строк и столбцов в файле Аванкор
    index_max = df_avancor.shape[0]
    collumn_max = df_avancor.shape[1]

    rashifr_14_v2()
    rashifr_15_v2()
    rashifr_16_v2()
    rashifr_17_v2()
    rashifr_18_v2()
    rashifr_19_v2()
    rashifr_20_v2()
    rashifr_21_v2()
    rashifr_22_v2()
    rashifr_23_v2()
    rashifr_24_v2()
    rashifr_25_v2()
    rashifr_26_v2()
    rashifr_27_v2()
    rashifr_28_v2()
    rashifr_29_v2()
    rashifr_30_v2()
    rashifr_31_v2()
    rashifr_32_v2()
    rashifr_33_v2()
    rashifr_34_v2()
    rashifr_35_v2()
    rashifr_36_v2()
    rashifr_37_v2()
    rashifr_38_v2()
    rashifr_39_v2()
    rashifr_40_v2()
    rashifr_41_v2()
    rashifr_42_v2()
    rashifr_43_v2()
    rashifr_44_v2()
    rashifr_45_v2()
    rashifr_46_v2()
    rashifr_47_v2()
    rashifr_48_v2()
    rashifr_49_v2()
    rashifr_50_v2()
    rashifr_51_v2()
    rashifr_52_v2()
    rashifr_53_v2()
    rashifr_54_v2()
    rashifr_55_v2()
    rashifr_58_v2()


# %%

if __name__ == "__main__":
    pass
